{
  "books": [
    {
      "id": "da85cca2-c7a9-496c-b56e-a2474cf46f8d",
      "name": "Javascript",
      "color": "#0a84ff",
      "icon": "📚",
      "created_at": "2026-02-23T08:37:21.867Z",
      "updated_at": "2026-02-23T09:23:57.894Z"
    }
  ],
  "sections": [
    {
      "id": "67131ee2-c586-4ccf-80bb-665ce6392863",
      "book_id": "da85cca2-c7a9-496c-b56e-a2474cf46f8d",
      "name": "Fundamentos",
      "created_at": "2026-02-23T08:53:48.375Z",
      "updated_at": "2026-02-23T09:23:13.024Z"
    }
  ],
  "notes": [
    {
      "id": "ffb88411-847a-4907-89a1-5085d2849e85",
      "section_id": "67131ee2-c586-4ccf-80bb-665ce6392863",
      "book_id": "da85cca2-c7a9-496c-b56e-a2474cf46f8d",
      "title": "Javascript",
      "content": "Fundamentos de javascript\n\nTipos de Datos\nVariables\nEstructuras condicionales\n\n",
      "tags": "[]",
      "created_at": "2026-02-23T08:55:25.349Z",
      "updated_at": "2026-02-23T08:58:40.466Z"
    }
  ],
  "presentations": [
    {
      "id": "389cccea-238d-4246-959d-5e2d67d87a55",
      "note_id": "ffb88411-847a-4907-89a1-5085d2849e85",
      "version": 1,
      "short_summary": "JavaScript es el lenguaje de programación esencial para añadir interactividad y dinamismo a las páginas web. Sus fundamentos incluyen el manejo de diversos tipos de datos para representar información, la declaración y gestión de variables para almacenar estos datos, y el uso de estructuras condicionales para controlar el flujo de ejecución del código basándose en decisiones lógicas, permitiendo crear experiencias de usuario complejas y reactivas.",
      "extended_summary": "•   **Orígenes y Evolución**: JavaScript fue creado por Brendan Eich en Netscape en tan solo 10 días en mayo de 1995. Originalmente llamado Mocha y luego LiveScript, fue renombrado a JavaScript para capitalizar la popularidad de Java en ese momento, aunque son lenguajes fundamentalmente diferentes.\n•   **Propósito Inicial**: Su objetivo era ser un lenguaje \"scripting\" ligero para hacer las páginas web dinámicas, validando formularios y añadiendo animaciones básicas directamente en el navegador, sin necesidad de recargar la página.\n•   **Tipado Dinámico y Débil**: JavaScript es un lenguaje de tipado dinámico, lo que significa que el tipo de una variable se determina en tiempo de ejecución y puede cambiar. También es de tipado débil, permitiendo conversiones de tipo implícitas, lo que a veces puede llevar a comportamientos inesperados (coerción).\n•   **Tipos de Datos Primitivos**: Incluyen String (texto), Number (números enteros y flotantes), Boolean (true/false), Null (ausencia intencional de valor), Undefined (ausencia de valor asignado), Symbol (identificadores únicos) y BigInt (números enteros muy grandes).\n•   **Tipos de Datos No Primitivos (Objeto)**: El tipo Object es el único tipo de dato no primitivo. Incluye arrays, funciones y objetos literales. Los objetos son colecciones de pares clave-valor y son fundamentales en JavaScript, que es un lenguaje orientado a objetos basado en prototipos.\n•   **Declaración de Variables (var, let, const)**: Antes de ES6, `var` era la única forma de declarar variables, con ámbito de función y propensa al *hoisting*. Con ES6 (2015), se introdujeron `let` y `const`, que tienen ámbito de bloque (`{...}`) y son preferibles para evitar errores comunes y mejorar la legibilidad del código. `const` se utiliza para valores que no cambiarán, mientras que `let` permite reasignación.\n•   **Ámbito (Scope)**: Se refiere a la visibilidad y accesibilidad de las variables. `var` tiene ámbito global o de función. `let` y `const` tienen ámbito de bloque, lo que significa que solo son accesibles dentro del bloque de código donde fueron declaradas.\n•   **Estructuras Condicionales (`if/else if/else`)**: Permiten ejecutar diferentes bloques de código basándose en si una o varias condiciones son verdaderas o falsas. Es la forma más fundamental de control de flujo en la programación.\n•   **Estructuras Condicionales (`switch`)**: Proporcionan una alternativa más legible y eficiente a múltiples `else if` cuando se necesita evaluar una única expresión contra múltiples valores posibles. Cada `case` representa un valor y `break` se usa para salir del `switch`.\n•   **Operadores Lógicos**: Fundamental para las condiciones, JavaScript utiliza `&&` (AND), `||` (OR) y `!` (NOT) para combinar o negar expresiones booleanas, permitiendo crear condiciones complejas.\n•   **Popularidad y Uso**: JavaScript es consistentemente uno de los lenguajes de programación más populares a nivel mundial (según encuestas como Stack Overflow Developer Survey), no solo para el desarrollo web frontend, sino también para backend (Node.js), aplicaciones móviles (React Native), escritorio (Electron) e incluso IoT y Machine Learning.\n•   **Single-threaded y Event Loop**: Aunque JavaScript es de un solo hilo, lo que significa que solo puede ejecutar una cosa a la vez, gestiona operaciones asíncronas (como peticiones de red o temporizadores) a través del 'Event Loop', lo que le permite no bloquear el hilo principal y mantener la interactividad.",
      "associations": "[{\"concept\":\"Tipado Dinámico de JavaScript\",\"association\":\"Imagina a JavaScript como un camaleón que cambia el color (tipo) de sus variables según el entorno (valor) que se le asigne.\",\"mnemonic\":\"El Camaleón JS: Hoy un número, mañana una palabra, ¡nunca sabes lo que será hasta que lo ves!\"},{\"concept\":\"`let` vs `var` (ámbito)\",\"association\":\"`var` es como un anuncio por megafonía en todo el estadio (función), todo el mundo lo oye. `let` es como un mensaje de texto en un grupo de WhatsApp (bloque), solo lo ven los miembros de ese grupo.\",\"mnemonic\":\"VAR-io al mundo, LET-ra pequeña solo para mi bloque.\"},{\"concept\":\"`null` vs `undefined`\",\"association\":\"`null` es una caja de regalo que sabes que está vacía, la abriste y no había nada dentro (ausencia intencional). `undefined` es una caja de regalo que aún no has abierto, ni siquiera sabes si hay algo dentro (valor no asignado o inexistente).\",\"mnemonic\":\"NULLo: Vacío a propósito. UNDEFINED: Ni idea de lo que hay, no se ha definido.\"},{\"concept\":\"Hoisting\",\"association\":\"Imagina que todas las declaraciones de `var` y funciones en JavaScript tienen un 'poder' para levitar (hoist) hasta la parte superior de su ámbito antes de que el código comience a ejecutarse. Solo las declaraciones, no las inicializaciones.\",\"mnemonic\":\"HOISTING: ¡Arriba las declaraciones, antes de que nada más comience!\"},{\"concept\":\"Operador de Igualdad Estricta (`===`)\",\"association\":\"Piensa en `===` como un detector de \\\"gemelos idénticos\\\". No solo verifican que se vean iguales (valor), sino que también tengan el mismo ADN (tipo de dato).\",\"mnemonic\":\"Los TRES IGUALES: Valor Y Tipo, ¡son estrictos!\"},{\"concept\":\"Estructuras Condicionales (`if/else`)\",\"association\":\"Es como un semáforo de decisiones en tu vida diaria. 'SI' está en verde, avanza. 'SINO SI' está en amarillo, ten precaución. 'SINO' (si nada de lo anterior) está en rojo, detente.\",\"mnemonic\":\"El semáforo IF/ELSE: Decide tu siguiente movimiento según la luz.\"}]",
      "mermaid_map": "mindmap\n  root((Javascript))\n    Fundamentos\n      Historia\n        Brendan Eich\n        Netscape\n        1995\n      Propósito\n        Interactividad Web\n        Dinamismo\n      Ejecución\n        Single-threaded\n        Event Loop\n    Tipos de Datos\n      Primitivos\n        String\n        Number\n        Boolean\n        Null\n        Undefined\n        Symbol\n        BigInt\n      No Primitivos\n        Object\n          Arrays\n          Funciones\n          Literales\n      Características\n        Tipado Dinámico\n        Tipado Débil\n        Coerción\n    Variables\n      Declaración\n        var\n        let\n        const\n      Ámbito (Scope)\n        Global\n        Función\n        Bloque\n      Hoisting\n      Mutabilidad\n    Estructuras Condicionales\n      if/else if/else\n      switch\n      Operador Ternario (? :)\n      Operadores Lógicos\n        AND (&&)\n        OR (||)\n        NOT (!)",
      "story": "En el vibrante laboratorio de innovaciones \"Nexus Tech\", la joven ingeniera Maya se enfrentaba a un desafío crucial: desarrollar el sistema de control para el nuevo asistente robótico, \"Unidad-J\", diseñado para automatizar las tareas del laboratorio. Su mentor, el profesor Andrés, le explicó que la clave estaba en dominar los **fundamentos de JavaScript**, el lenguaje que daría vida a la lógica de \"Unidad-J\".\n\n\"Imagina que 'Unidad-J' necesita saber qué hacer con cada pieza de información\", comenzó Andrés. \"Para eso, usamos **Tipos de Datos**. Si 'Unidad-J' debe identificar el nombre de un experimento, es un `String` como 'Proyecto Phoenix'. Si cuenta el número de muestras, es un `Number` como `15`. Y si comprueba si una prueba ha pasado, es un `Boolean`: `true` o `false`.\"\n\nMaya asintió. \"Entiendo. ¿Y cómo guarda 'Unidad-J' esos datos mientras trabaja?\" Andrés sonrió. \"Ahí entran las **Variables**. Podemos usar `let` nombreExperimento = 'Proyecto Phoenix'; o `const` maxMuestras = 100;. `let` es para cosas que pueden cambiar, como un contador, mientras que `const` es para valores fijos. Piensa en ellas como etiquetas para cajas donde guardamos nuestra información, facilitando que 'Unidad-J' acceda a ella.\"\n\n\"Finalmente\", continuó Andrés, \"'Unidad-J' no es solo un almacén de datos; ¡debe tomar decisiones! Para eso usamos las **Estructuras Condicionales**. Por ejemplo: `if (temperaturaHorno > 200) { enfriarHorno(); } else if (temperaturaHorno < 100) { calentarHorno(); } else { mantenerTemperatura(); }`. O un `switch` para elegir un protocolo según el tipo de muestra. Estas estructuras son el cerebro de 'Unidad-J', permitiéndole reaccionar inteligentemente a cada situación y hacer el laboratorio más eficiente y seguro. Con estos fundamentos, Maya, estás lista para construir cualquier cosa.\"",
      "image_url": "https://picsum.photos/seed/1047/1200/400",
      "created_at": "2026-02-23T08:59:11.599Z"
    },
    {
      "id": "be2672e3-f75b-48bd-9990-21d47b99c839",
      "note_id": "ffb88411-847a-4907-89a1-5085d2849e85",
      "version": 2,
      "short_summary": "JavaScript es un lenguaje esencial para la web, estructurado sobre bases fundamentales. Sus Tipos de Datos definen la naturaleza de la información, desde texto hasta números. Las Variables actúan como contenedores para almacenar y gestionar estos datos. Finalmente, las Estructuras Condicionales otorgan al programa la capacidad de tomar decisiones lógicas, ejecutando diferentes acciones según el cumplimiento de condiciones específicas, lo que es vital para la interactividad y el control de flujo.",
      "extended_summary": "•   **JavaScript (JS)** es un lenguaje de programación de alto nivel, interpretado o compilado 'just-in-time', y multiparadigma, siendo un pilar fundamental de la World Wide Web para añadir interactividad y dinamismo a las páginas web junto con HTML y CSS.\n•   Fue creado en 1995 por Brendan Eich en Netscape Communications en tan solo diez días, inicialmente bajo el nombre de 'Mocha', luego 'LiveScript', y finalmente 'JavaScript' por razones de marketing, capitalizando la popularidad de Java en ese momento.\n•   Los **Tipos de Datos** en JavaScript clasifican los valores. Se dividen en dos categorías principales: Primitivos (String, Number, Boolean, Undefined, Null, Symbol introducido en ES6, y BigInt introducido en ES2020) y Objetos (como arrays, funciones y objetos literales).\n•   JavaScript es un lenguaje de **tipado dinámico**, lo que significa que el tipo de una variable no necesita ser declarado explícitamente y puede cambiar durante la ejecución del programa. El intérprete determina el tipo en tiempo de ejecución, ofreciendo flexibilidad pero requiriendo un manejo cuidadoso.\n•   **Variables** son contenedores con nombre para almacenar valores de datos. Históricamente, `var` fue la única palabra clave para declarar variables, pero con la introducción de ES2015 (ES6) llegaron `let` y `const` para ofrecer un control de alcance y mutabilidad más preciso.\n•   `var` tiene un alcance de función o global, lo que puede llevar a comportamientos inesperados (como el 'hoisting' con efectos secundarios no deseados). `let` tiene un alcance de bloque y permite la reasignación. `const` también tiene alcance de bloque, pero está diseñada para valores que no cambiarán, ya que no permite ni la redeclaración ni la reasignación, ideal para constantes.\n•   El **'hoisting'** es un concepto donde las declaraciones de `var` y funciones son procesadas antes de que el código se ejecute, moviéndose conceptualmente al inicio de su alcance. `let` y `const` también son 'hoisted' pero entran en una 'zona muerta temporal' (Temporal Dead Zone - TDZ) y no pueden usarse antes de su declaración explícita, previniendo errores comunes de `var`.\n•   Las **Estructuras Condicionales** son esenciales para el control del flujo del programa, permitiendo que el código tome decisiones y ejecute diferentes bloques de instrucciones basándose en si una condición es verdadera o falsa.\n•   La declaración `if...else if...else` es la estructura condicional más fundamental. Evalúa una serie de condiciones en orden; la primera condición que sea verdadera ejecuta su bloque de código y las demás se omiten. Si ninguna es verdadera, se ejecuta el bloque `else` (si existe).\n•   La declaración `switch` es una alternativa a una larga cadena de `if...else if` cuando se necesita comparar una sola expresión con múltiples valores posibles (casos). Es particularmente útil para mejorar la legibilidad del código en escenarios con muchas opciones mutuamente excluyentes.\n•   El **operador ternario** (`condicion ? expresion1 : expresion2`) es una forma concisa de escribir un `if...else` simple en una sola línea. Devuelve `expresion1` si la `condicion` es verdadera, y `expresion2` si es falsa, siendo muy útil para asignaciones o retornos condicionales.\n•   Los **Operadores Lógicos** (`&&` AND, `||` OR, `!` NOT) se utilizan para combinar múltiples condiciones o para negar una condición. Los **Operadores de Comparación** (`==`, `===`, `!=`, `!==`, `>`, `<`, `>=`, `<=`) comparan dos valores y devuelven un valor booleano. La igualdad estricta `===` es preferida porque compara tanto el valor como el tipo, evitando las coerciones de tipo implícitas que ocurren con `==` y que pueden generar errores sutiles.",
      "associations": "[{\"concept\":\"var\",\"association\":\"El 'comodin' del barrio sin muchas reglas\",\"mnemonic\":\"Imagina a 'var' como un niño travieso que juega en todo el barrio (su alcance de funcion), sus juguetes (valores) pueden cambiar en cualquier momento y nadie se sorprende si ya esta alli (hoisting) incluso antes de que lo inviten a jugar. Es flexible, pero a veces causa desorden.\"},{\"concept\":\"const\",\"association\":\"El juramento inquebrantable de la variable\",\"mnemonic\":\"Const es como el voto de un superheroe: una vez que prometes ser un valor (le asignas algo), esa promesa es inquebrantable (no puedes reasignar). Si tu valor es un objeto, puedes cambiar tus herramientas (sus propiedades internas), pero nunca cambiar quien eres (el objeto completo). Es firme y confiable.\"},{\"concept\":\"hoisting\",\"association\":\"El mago que eleva las declaraciones\",\"mnemonic\":\"El 'hoisting' es un mago peculiar. Antes de que el show (el codigo) comience, el mago eleva las declaraciones de 'var' y funciones a lo alto del escenario (el inicio de su alcance), asi que estan disponibles. Con 'let' y 'const', tambien las eleva, pero las deja en una caja cerrada (zona muerta temporal) hasta que el publico (el interprete) las vea en su posicion original. No se pueden usar antes.\"},{\"concept\":\"===\",\"association\":\"El detective de identidad estricta\",\"mnemonic\":\"El triple igual '===' es como un detective que busca un sospechoso. No solo tiene que tener la misma cara (mismo valor), ¡sino tambien el mismo numero de identificacion (mismo tipo de dato)! Si el valor es '5' y el tipo es 'String', pero buscas un 'Number' 5, el detective '===' dira: '¡Alto, no es el mismo!'\"},{\"concept\":\"null\",\"association\":\"El sobre vacio intencional\",\"mnemonic\":\"Null es como un sobre que te han entregado a proposito, pero esta vacio. Representa una ausencia de valor deliberada, un 'no hay nada aqui' que tu mismo has decidido. No es que el sobre no exista, solo que su contenido es explicitamente nulo.\"},{\"concept\":\"undefined\",\"association\":\"El sobre que olvidaron rellenar\",\"mnemonic\":\"Undefined es como un sobre que te dieron, pero simplemente nadie le puso nada dentro, o ni siquiera se sabia que se suponia que debia contener. Es un valor asignado automaticamente cuando algo no ha sido inicializado o no existe. Es una ausencia no intencional.\"},{\"concept\":\"Tipado Dinamico\",\"association\":\"El camaleon de los valores\",\"mnemonic\":\"El tipado dinamico es como un camaleon que cambia de color. Una misma variable puede ser un numero azul, luego una palabra verde, y despues un booleano rojo, todo en el mismo programa, sin que tengas que avisarle de su nuevo color. JavaScript lo descubre sobre la marcha, lo que da mucha flexibilidad, pero requiere cuidado.\"}]",
      "mermaid_map": "mindmap\n  root((Javascript Fundamentos))\n    Historia\n      Creacion 1995\n      Brendan Eich\n      Netscape\n      ECMAScript\n    Tipos de Datos\n      Primitivos\n        String Number Boolean\n        Undefined Null Symbol BigInt\n      Objetos\n        Arrays Funciones\n        Tipado Dinamico\n    Variables\n      Declaracion\n        var\n        let\n        const\n      Alcance Scope\n        Global Funcion\n        Bloque Block\n      Hoisting\n    Condicionales\n      Estructuras\n        if else if else\n        switch\n        Operador Ternario\n      Operadores\n        Comparacion\n        Logicos AND OR NOT",
      "story": "En el vibrante laboratorio de inventos de la Dra. Ava Coder, la emoción era palpable. Ella estaba diseñando un robot asistente para su comunidad, 'Codi', y necesitaba que pensara como un humano. La Dra. Coder sabía que, para darle vida, debía dominar los fundamentos de JavaScript. \"Codi, piensa en esto como tu ADN,\" dijo, señalando la pizarra llena de código. \"Primero, tenemos los Tipos de Datos. Eres una máquina, así que todo son Números para ti. Pero para interactuar con los humanos, necesitarás Strings, para el lenguaje, y Booleanos, para saber si algo es 'sí' o 'no'. Por ejemplo, si un niño te pregunta '¿Está soleado?', tu respuesta, un String, dependerá de un Booleano que dice si 'estaSoleado' es verdadero o falso.\"\n\n\"Luego, Codi, para recordar cosas, necesitamos Variables,\" continuó la Dra. Coder. \"Al principio, usábamos `var` para todo, como un cajón sin etiqueta donde podías meter y sacar lo que quisieras, incluso antes de que el cajón existiera visiblemente – a eso lo llamamos 'hoisting'. Pero aprendimos que era mejor ser más específicos. Con `let`, es como una caja con etiqueta que puedes rellenar, pero no puedes tener dos cajas con la misma etiqueta en el mismo lugar. Y `const` es como un contrato inquebrantable: una vez que le pones un valor, es para siempre, ¡como tu nombre 'Codi'!\". Ella le explicó que estas variables tenían un 'alcance' específico, como el área donde cada cajón o caja podía ser vista y usada, crucial para evitar confusiones.\n\nFinalmente, para que Codi pudiera tomar decisiones inteligentes, la Dra. Coder implementó las Estructuras Condicionales. \"Imagina que un niño quiere cruzar la calle,\" explicó. \"Tu lógica sería: `IF` el semáforo está en verde `AND` no hay coches (`&&`), `THEN` puedes cruzar. `ELSE IF` el semáforo está en rojo `OR` hay coches (`||`), `THEN` debes esperar. Y si hay muchas opciones, como diferentes sabores de helado que un cliente podría pedir, usarías un `SWITCH` para dar la respuesta adecuada a cada elección. ¡Con esto, Codi, ya no serás solo un montón de circuitos, sino un asistente pensante y reactivo!\" Codi parpadeó sus luces azules, como si ya estuviera procesando la información, listo para sus futuras interacciones con la comunidad.",
      "image_url": "https://picsum.photos/seed/1047/1200/400",
      "created_at": "2026-02-23T09:08:56.582Z"
    },
    {
      "id": "72d0561c-3d96-4fd4-bdf7-31b5b6cfe5c1",
      "note_id": "ffb88411-847a-4907-89a1-5085d2849e85",
      "version": 3,
      "short_summary": "Javascript se fundamenta en la manipulación de datos, el almacenamiento dinámico de información y la toma de decisiones lógicas. Con tipos de datos variados, desde números hasta objetos complejos, permite a los desarrolladores guardar valores en variables (`let`, `const`) y controlar el flujo de ejecución con estructuras condicionales (`if/else`, `switch`), esenciales para crear aplicaciones interactivas y dinámicas para la web y más allá.",
      "extended_summary": "• Javascript es un lenguaje de programación multiparadigma, ligero e interpretado, conocido principalmente por su rol en el desarrollo web front-end. Fue creado por Brendan Eich en Netscape Communications en mayo de 1995, inicialmente bajo el nombre de LiveScript.\n• Su diseño inicial se realizó en solo 10 días, con el objetivo de añadir interactividad a las páginas web. Posteriormente, fue renombrado a JavaScript para capitalizar la popularidad de Java, aunque ambos lenguajes tienen diferencias fundamentales.\n• **Tipos de Datos:** JavaScript es un lenguaje de tipado dinámico y débil. Esto significa que no es necesario declarar explícitamente el tipo de una variable y que el motor de JavaScript puede realizar conversiones implícitas de tipos (coerción de tipos) para facilitar las operaciones.\n• Los **tipos de datos primitivos** incluyen `String` (cadenas de texto), `Number` (números enteros y de coma flotante), `Boolean` (verdadero/falso), `Null` (ausencia intencionada de valor), `Undefined` (valor de una variable no asignada), `Symbol` (identificadores únicos) y `BigInt` (números enteros muy grandes introducidos en ES2020).\n• Los **tipos de datos de objeto** son más complejos y mutables, incluyendo objetos literales `{}`, arrays `[]` y funciones. A diferencia de los primitivos, los objetos se pasan por referencia.\n• **Variables:** Son contenedores para almacenar valores. La introducción de `let` y `const` en ES6 (ECMAScript 2015) mejoró significativamente la gestión del alcance y la mutabilidad en comparación con el antiguo `var`.\n• `var` tiene un alcance de función (function scope) y puede ser redeclarada y reasignada. `let` tiene un alcance de bloque (block scope) y puede ser reasignada, pero no redeclarada en el mismo bloque. `const` también tiene alcance de bloque y no puede ser reasignada después de su inicialización, lo que la hace ideal para valores que no deben cambiar.\n• **Hoisting:** Es un concepto en JavaScript donde las declaraciones de variables y funciones son procesadas antes de la ejecución del código. Con `var`, las declaraciones son \"subidas\" (hoisted) e inicializadas con `undefined`, mientras que `let` y `const` también se \"suben\" pero no se inicializan, lo que lleva al \"Temporal Dead Zone\" antes de su declaración.\n• **Estructuras Condicionales:** Permiten ejecutar diferentes bloques de código basándose en el resultado de una expresión booleana. Las más comunes son `if/else if/else`, que evalúan condiciones en secuencia y ejecutan el primer bloque cuya condición sea verdadera.\n• La declaración `switch` es útil para evaluar una única expresión contra múltiples valores posibles, ofreciendo una alternativa más limpia a una serie de `if/else if` anidados cuando se compara el mismo valor. Es crucial usar `break` para evitar la \"caída\" (fall-through) a los siguientes `case`.\n• El **operador ternario** `(condicion ? valorSiVerdadero : valorSiFalso)` es una forma concisa de escribir una estructura `if/else` simple en una sola línea, a menudo utilizado para asignaciones condicionales o para retornar valores rápidamente.\n• Estas estructuras, junto con los bucles y las funciones, son fundamentales para el control de flujo en cualquier programa, permitiendo que las aplicaciones respondan dinámicamente a la entrada del usuario, al estado del sistema o a los datos recibidos, formando la base de la lógica de negocio y la interactividad.",
      "associations": "[{\"concept\":\"let vs const\",\"association\":\"let es como un post-it, puedes escribir y borrar varias veces (reasignar). const es como un tatuaje, una vez puesto, no se borra (no reasignable).\",\"mnemonic\":\"LET me change it, CONSTant value.\"},{\"concept\":\"null vs undefined\",\"association\":\"null es un plato vacio que decides poner en la mesa (ausencia intencionada). undefined es un plato que deberia estar en la mesa pero que nunca llego (valor no asignado).\",\"mnemonic\":\"NULL, lo puse yo. UNDEFINED, un definido que falta.\"},{\"concept\":\"Hoisting\",\"association\":\"Imagina un mago que antes de empezar su truco (ejecutar codigo), ya tiene todos sus objetos (declaraciones de variables y funciones) en la mesa, aunque no los muestre hasta el momento adecuado.\",\"mnemonic\":\"HOISTING: Las declaraciones se elevan al principio.\"},{\"concept\":\"Alcance (Scope)\",\"association\":\"Es como la visibilidad de un cartel. Un cartel global se ve desde cualquier parte de la ciudad. Un cartel de funcion solo se ve dentro del edificio de esa funcion. Un cartel de bloque solo se ve en una habitacion especifica.\",\"mnemonic\":\"SCOPE: ¿Donde puedo VER esta variable?\"},{\"concept\":\"Coercion de Tipos\",\"association\":\"Piensa en un traductor automatico que intenta entender dos idiomas diferentes (ej. numero y string) y los convierte a uno para que puedan 'conversar' (operar juntos).\",\"mnemonic\":\"COERCION: Convertir tipos para que se 'lleven bien'.\"},{\"concept\":\"Operador Ternario\",\"association\":\"Es como un semaforo de un solo brazo. Si esta levantado (condicion verdadera), vas por un camino. Si esta bajado (condicion falsa), vas por el otro.\",\"mnemonic\":\"TERNARIO: Tres partes, una decision rapida.\"},{\"concept\":\"Tipado Dinamico\",\"association\":\"Un camaleon que puede cambiar su color (tipo) en cualquier momento sin previo aviso.\",\"mnemonic\":\"DINAMICO: El tipo de dato cambia como el camaleon.\"}]",
      "mermaid_map": "mindmap\n  root((Javascript Fundamentos))\n    Tipos de Datos\n      Primitivos\n      Objetos\n      Tipado Dinamico\n      Coercion\n    Variables\n      Declaracion\n      Alcance Scope\n      Hoisting\n      Let Const Var\n    Condicionales\n      If Else\n      Switch\n      Operador Ternario\n    Contexto Historico\n      Brendan Eich\n      Netscape\n      Creacion 1995\n    Uso Actual\n      Web Interactiva\n      Backend Nodejs\n      Mobile Apps",
      "story": "Leo era un joven desarrollador con una pasion por los libros y la programacion. Su primer gran proyecto en la universidad era crear una pagina web interactiva para la biblioteca virtual del campus. Empezo con los Fundamentos de Javascript, sabiendo que eran las herramientas clave para dar vida a su sitio.\n\nPrimero, se enfrento a los Tipos de Datos. 'Cada libro tiene sus caracteristicas', penso Leo. 'El titulo es un 'String' (cadena de texto), el numero de paginas es un 'Number' (numero), y si esta disponible para prestamo, es un 'Boolean' (verdadero o falso)'. Incluso los autores podrian ser objetos complejos con sus propios datos. Entendio que Javascript era muy flexible, permitiendole cambiar el tipo de dato de una 'caja' (variable) en cualquier momento, como un camaleon que cambia de color para adaptarse.\n\nLuego, Leo necesitaba almacenar la informacion de cada libro y usuario, asi que se sumergio en las Variables. Decidio usar `const` para los nombres de los generos literarios que nunca cambiarian, como 'Ficcion' o 'Ciencia'. Para el contador de libros disponibles, uso `let`, ya que ese numero variaria constantemente. '¡Ah, la diferencia!', exclamo. `const` era un compromiso firme, como el nombre de la biblioteca, mientras que `let` era como un marcador borrable en una pizarra. Aprendio que `var` era como una vieja carpeta que se guardaba en cualquier sitio, mientras que `let` y `const` eran mas ordenados, manteniendo su informacion dentro de bloques especificos, evitando que se mezclaran los datos.\n\nFinalmente, para que la biblioteca fuera verdaderamente interactiva, Leo implemento las Estructuras Condicionales. 'Si el usuario busca un libro que esta 'disponible' (condicion verdadera), entonces lo muestro en los resultados', razono. Uso un `if/else` para decidir si mostrar 'Anadir al carrito' o 'Reservado'. Para las diferentes secciones del menu (ciencia, historia, arte), un `switch` era perfecto, actuando como un recepcionista que dirige a cada usuario al estante correcto segun su consulta. Incluso uso un operador ternario para un mensaje rapido: `¿(libroEnStock ? 'Comprar' : 'Esperar')`. Gracias a estas estructuras, la biblioteca de Leo cobro vida, guiando a los usuarios de manera logica y eficiente a traves de su vasto catalogo digital.",
      "image_url": "https://picsum.photos/seed/1047/1200/400",
      "created_at": "2026-02-23T10:12:30.078Z"
    },
    {
      "id": "b6757124-9b17-4e69-922a-d20a15e3786f",
      "note_id": "ffb88411-847a-4907-89a1-5085d2849e85",
      "version": 4,
      "short_summary": "JavaScript es un lenguaje de programación esencial para la web, enfocado en la interactividad. Sus fundamentos incluyen el manejo de diversos tipos de datos para representar información, la declaración y gestión de valores mediante variables con distintos alcances, y la implementación de lógica de decisión a través de estructuras condicionales. Estos pilares permiten construir aplicaciones dinámicas y reactivas, formando la base para la experiencia moderna del usuario en internet.",
      "extended_summary": "# 💻 Introducción a JavaScript\n\nJavaScript (JS) es un lenguaje de programación interpretado o \"just-in-time\" compilado, de alto nivel y con tipado dinámico, que se adhiere al estándar ECMAScript. Fue creado por Brendan Eich en 1995 durante su tiempo en Netscape Communications Corporation, en tan solo 10 días, inicialmente con el nombre de \"Mocha\", luego renombrado a \"LiveScript\" y finalmente a \"JavaScript\" para capitalizar la popularidad de Java en ese momento, aunque ambos lenguajes tienen propósitos y filosofías de diseño muy diferentes. Su propósito original era añadir interactividad a las páginas web que hasta entonces eran estáticas, ejecutándose directamente en el navegador del cliente.\n\n## Orígenes y Evolución\n\nEl nacimiento de JavaScript marcó un antes y un después en la World Wide Web. Antes de JS, la interactividad en el navegador era limitada y requería plugins pesados. Brendan Eich recibió el encargo de crear un lenguaje de script ligero para el navegador Netscape Navigator 2.0. A pesar de su rápido desarrollo, JS se convirtió rápidamente en un estándar de facto. La estandarización de ECMAScript por ECMA International en 1997, con la especificación ECMA-262, garantizó que JS pudiera ser implementado de manera consistente por diferentes navegadores, aunque las implementaciones variaron significativamente en los primeros años. A lo largo de las décadas, JavaScript ha evolucionado exponencialmente. Con la introducción de Node.js en 2009 por Ryan Dahl, JavaScript trascendió el navegador, permitiendo a los desarrolladores usarlo para la programación del lado del servidor, aplicaciones de escritorio (Electron), móviles (React Native) y microcontroladores. Esta expansión lo ha consolidado como uno de los lenguajes de programación más versátiles y utilizados en la actualidad, con una comunidad de desarrolladores global que supera los 18 millones de usuarios según el informe de Stack Overflow Developer Survey 2023.\n\n## ¿Qué es JavaScript?\n\nJavaScript se caracteriza por ser un lenguaje multiparadigma, soportando estilos de programación orientados a objetos (basado en prototipos), imperativos y funcionales. Es un lenguaje \"single-threaded\" por defecto, pero con la capacidad de manejar operaciones asíncronas de manera no bloqueante gracias a su \"event loop\". Esta arquitectura es crucial para mantener la reactividad de las interfaces de usuario. Además, al ser un lenguaje interpretado, el código JavaScript es ejecutado línea por línea por el motor de JavaScript (como V8 en Chrome o SpiderMonkey en Firefox) sin necesidad de una fase de compilación previa por parte del desarrollador, lo que agiliza el ciclo de desarrollo y prueba. Su tipado dinámico significa que el tipo de una variable no necesita ser declarado explícitamente y puede cambiar durante la ejecución del programa.\n\n# 💾 Fundamentos de la Programación en JS\n\nEntender los fundamentos de JavaScript es crucial para construir cualquier aplicación robusta. Esto incluye cómo el lenguaje representa la información, cómo se almacena y manipula, y cómo se controla el flujo de ejecución del programa.\n\n## Tipos de Datos Esenciales\n\nEn JavaScript, todo valor tiene un tipo de dato asociado, que define el conjunto de operaciones que se pueden realizar con él y cómo se almacena en memoria. Los tipos de datos se dividen principalmente en primitivos y objetos.\n\n### Primitivos\nEstos son los bloques de construcción más básicos de los datos en JavaScript, inmutables y sin métodos propios (aunque a menudo se comportan como si los tuvieran gracias a un proceso llamado \"autoboxing\").\n• **`Number`**: Representa tanto enteros como números de punto flotante de doble precisión (64-bit IEEE 754). Ejemplos: `10`, `3.14`, `-5`. También incluye valores especiales como `NaN` (Not-a-Number) e `Infinity`.\n• **`String`**: Secuencias de caracteres Unicode, inmutables. Se declaran con comillas simples, dobles o plantillas literales (backticks). Ejemplos: `\"Hola Mundo\"`, `'JavaScript'`, `` `La versión es ${version}` ``.\n• **`Boolean`**: Representa un valor lógico, `true` o `false`. Fundamental para el control de flujo.\n• **`Undefined`**: Indica que una variable ha sido declarada pero aún no se le ha asignado un valor. Es el valor por defecto.\n• **`Null`**: Representa la ausencia intencionada de cualquier valor u objeto. Es un valor asignable.\n• **`Symbol`**: Introducido en ES6 (ECMAScript 2015), garantiza la unicidad de un valor. Útil para claves de objeto no conflictivas.\n• **`BigInt`**: También de ES2020, permite representar números enteros de una magnitud arbitrariamente grande, más allá del límite de `Number`.\n\n### Objetos\nSon colecciones de propiedades (pares clave-valor) y el tipo de dato fundamental para estructuras más complejas. Son mutables y se pasan por referencia.\n• **`Object`**: El tipo base para todos los objetos, incluyendo arreglos, funciones y objetos personalizados. Ejemplos: `{ nombre: \"Ana\", edad: 30 }`.\n• **`Array`**: Una subclase de `Object`, utilizada para almacenar colecciones ordenadas de elementos. Ejemplos: `[1, 2, 3]`, `[\"manzana\", \"pera\"]`.\n• **`Function`**: Objetos especiales que pueden ser invocados para ejecutar código. En JavaScript, las funciones son ciudadanos de primera clase.\n\n## Gestión de Información con Variables\n\nLas variables son contenedores con nombre para almacenar valores en JavaScript. Permiten a los desarrolladores referenciar y manipular datos a lo largo de la ejecución de un programa. JavaScript ofrece tres palabras clave para declarar variables: `var`, `let` y `const`, cada una con características distintas en cuanto a su alcance y posibilidad de reasignación.\n\n### Declaración y Alcance\n• **`var`**: La palabra clave original para declarar variables. Las variables declaradas con `var` tienen alcance de función (o global si se declaran fuera de cualquier función). Esto significa que son accesibles en toda la función donde se definen, independientemente de los bloques anidados (`if`, `for`). Se pueden redeclarar y reasignar. Su uso es desaconsejado en el código moderno debido a su comportamiento a menudo contraintuitivo.\n• **`let`**: Introducida en ES6, `let` declara variables con alcance de bloque. Esto significa que una variable `let` solo es accesible dentro del bloque de código (y sus sub-bloques) donde se define. No se puede redeclarar una variable `let` en el mismo alcance, pero sí se puede reasignar su valor.\n• **`const`**: También introducida en ES6, `const` declara una constante con alcance de bloque. Una vez que se asigna un valor a una constante `const`, no se puede reasignar (es decir, no se puede cambiar la referencia de la variable a otro valor). Sin embargo, si el valor asignado es un objeto o un array, el *contenido* de ese objeto o array sí puede modificarse. Las constantes `const` deben ser inicializadas en el momento de su declaración.\n\n### Hoisting y Reasignación\n• **Hoisting**: Es un comportamiento de JavaScript donde las declaraciones de variables (`var`, `let`, `const`) y funciones son movidas \"virtualmente\" al principio de su alcance durante la fase de compilación, antes de que el código se ejecute. Con `var`, la declaración y la inicialización (`undefined`) son \"hoisted\". Con `let` y `const`, solo la declaración es hoisted, pero permanecen en una \"zona muerta temporal\" hasta que se encuentran en su línea de declaración, lo que evita accesos prematuros y errores de referencia.\n• **Reasignación**: La posibilidad de cambiar el valor de una variable. `var` y `let` permiten la reasignación. `const` no permite reasignar la referencia de la variable, solo modificar el contenido si es un objeto o array.\n\n## Control del Flujo con Estructuras Condicionales\n\nLas estructuras condicionales son fundamentales para la lógica de un programa, permitiendo ejecutar diferentes bloques de código según si una condición es verdadera o falsa.\n\n### Decisiones Simples\n• **`if...else`**: La estructura condicional más básica. Ejecuta un bloque de código si una condición es `true`, y opcionalmente otro bloque si es `false`.\njavascript\nif (edad >= 18) {\n  console.log(\"Es mayor de edad.\");\n} else {\n  console.log(\"Es menor de edad.\");\n}\n\n• **`else if`**: Permite encadenar múltiples condiciones. El programa evalúa las condiciones secuencialmente y ejecuta el bloque del primer `else if` cuya condición sea `true`.\njavascript\nif (puntaje >= 90) {\n  calificacion = 'A';\n} else if (puntaje >= 80) {\n  calificacion = 'B';\n} else {\n  calificacion = 'C';\n}\n\n\n### Selección Múltiple\n• **`switch`**: Utilizado para tomar decisiones basadas en el valor exacto de una expresión. Es una alternativa más limpia a múltiples `else if` cuando se comparan con valores fijos. La sentencia `break` es crucial para salir del `switch` una vez que se encuentra una coincidencia, de lo contrario, el código continuará ejecutándose en los siguientes `case` (comportamiento conocido como \"fall-through\"). El bloque `default` se ejecuta si ninguna de las condiciones `case` coincide.\njavascript\nlet dia = \"Lunes\";\nswitch (dia) {\n  case \"Lunes\":\n    console.log(\"Inicio de semana.\");\n    break;\n  case \"Viernes\":\n    console.log(\"Fin de semana cerca.\");\n    break;\n  default:\n    console.log(\"Día normal.\");\n}\n\n\n### Operador Ternario\n• Es una forma concisa de escribir una sentencia `if...else` simple en una sola línea. Tiene la forma `condicion ? expresionSiVerdadero : expresionSiFalso`. Es ideal para asignaciones condicionales rápidas.\njavascript\nlet estado = (esActivo === true) ? \"Activo\" : \"Inactivo\";\n\nEste operador es útil para mejorar la legibilidad en expresiones cortas, pero para lógicas más complejas, las estructuras `if/else` son preferibles para mantener la claridad del código.",
      "associations": "[{\"concept\":\"`var` (alcance de función)\",\"association\":\"Un micrófono antiguo con cable largo.\",\"mnemonic\":\"\\\"VAR es un micrófono *vario* que llega a cualquier rincón de la sala (función), incluso si lo pones en un rincón pequeño (bloque), el cable siempre llega lejos.\\\"\"},{\"concept\":\"`let` (alcance de bloque)\",\"association\":\"Un walkie-talkie.\",\"mnemonic\":\"\\\"LET (déjame) hablar solo con los que están en este BLOQUE. Si sales del bloque, pierdes la señal.\\\"\"},{\"concept\":\"`const` (constante, alcance de bloque)\",\"association\":\"Un ladrillo de LEGO \\\"enganchado\\\" a la base.\",\"mnemonic\":\"\\\"CONST es como un ladrillo que una vez que lo *pones* (inicializas), *no lo puedes quitar* de ese bloque (no reasignar). Pero si es una caja de LEGO, puedes cambiar las piezas *dentro* de la caja.\\\"\"},{\"concept\":\"`null` vs `undefined`\",\"association\":\"`null` es un plato vacío que *has decidido* que esté vacío. `undefined` es un plato que *nunca se llenó* porque ni siquiera lo pusiste en la mesa.\",\"mnemonic\":\"\\\"NULL - NADA (intencionadamente). UNDEFINED - UN-DE-FINido (no se ha definido nada).\\\"\"},{\"concept\":\"Hoisting\",\"association\":\"Una lista de la compra.\",\"mnemonic\":\"\\\"Antes de ir de compras (ejecutar el código), haces una lista (el motor de JS \\\"hoistea\\\" las declaraciones al principio). Sabes *qué* vas a comprar (declaraciones), pero no tienes los artículos *todavía* (valores) hasta que llegas a la tienda (línea de ejecución).\\\"\"},{\"concept\":\"`===` (igualdad estricta)\",\"association\":\"Un \\\"hermano gemelo\\\" idéntico.\",\"mnemonic\":\"\\\"Los TRES iguales (===) buscan un gemelo: no solo se parecen (valor), sino que *son idénticos* en cada célula (tipo de dato y valor).\\\"\"},{\"concept\":\"Truthy/Falsy values\",\"association\":\"Gafas \\\"mágicas\\\" de detectar la verdad.\",\"mnemonic\":\"\\\"Con mis gafas mágicas, veo que el 0, la cadena vacía, `null`, `undefined`, `NaN` y `false` son sombras (Falsy). Todo lo demás tiene luz (Truthy).\\\"\"}]",
      "mermaid_map": "mindmap\n  root((Javascript Fundamentos))\n    Tipos de Datos\n      Primitivos\n      Objetos\n    Variables\n      Var\n      Let\n      Const\n    Estructuras Condicionales\n      If Else\n      Switch\n      Ternario\n    Conceptos Clave\n      Hoisting\n      Scope\n      Truthy Falsy\n    Operadores\n      Comparacion\n      Logicos\n      Aritmeticos",
      "story": "El viejo reloj de pared del \"Café del Código\" marcaba las tres cuando Alex, un joven desarrollador junior, suspiró frente a su monitor. Estaba atascado en el módulo de inventario de una biblioteca virtual. \"Necesito que la página muestre si un libro está disponible y, si no, cuántos días faltan para su devolución\", le había dicho su mentora, Elena, una desarrolladora senior con décadas de experiencia. La tarea parecía sencilla, pero los \"Tipos de Datos\" de JavaScript le daban dolores de cabeza. ¿Era `null` o `undefined` cuando un libro no existía? ¿Debía usar un `Number` para los días o un `String` con un mensaje? La línea entre ellos era borrosa en su mente.\n\nElena se acercó con dos tazas de café humeante. \"Alex, piensa en los libros como valores. Cada uno tiene un tipo. ¿Es un cuento? Eso es un `String`. ¿Cuántos tienes? Eso es un `Number`. Si un espacio en la estantería está vacío porque *decidimos* no poner nada, es `null`. Si no sabemos si algo debería estar allí, es `undefined`.\" Alex asintió, las `Variables` empezaban a tener sentido. \"Usa `const` para el título del libro, porque no va a cambiar. Usa `let` para la cantidad disponible, porque eso sí cambia. `var`... bueno, `var` es como ese libro polvoriento en la estantería de arriba que nadie usa y cuyo paradero es un misterio\", bromeó Elena. \"Prefiere `let` y `const`, dan más control.\"\n\nLa parte más desafiante era la lógica de disponibilidad. Elena le explicó las `Estructuras Condicionales`. \"Para decidir si mostrar 'Disponible' o 'En préstamo', necesitas un `if...else`. Si el `stock > 0`, `if (stock > 0)`, entonces 'Disponible'. `else`, 'En préstamo'. Si tienes muchas condiciones para distintos estados del libro, como 'En reparación', 'Reservado', 'Perdido', un `switch` es más elegante que muchos `else if` anidados, ¿no crees? Cada `case` es un estado posible.\"\n\nAlex visualizó el código: `if (libro.disponible === true) { ... } else if (libro.diasHastaDevolucion > 0) { ... } else { ... }`. Los datos de la biblioteca cobraban vida. Con la ayuda de Elena, la lógica del `switch` para los estados especiales y el operador `ternario` para un mensaje rápido de \"stock bajo\" se implementaron sin problemas. Al final de la tarde, la página mostraba información precisa y dinámica. Alex sonrió. Había transformado los fundamentos abstractos de JavaScript en una solución práctica, trayendo orden al caótico inventario de libros virtuales.",
      "image_url": "https://picsum.photos/seed/1047/1200/400",
      "created_at": "2026-02-23T16:49:50.607Z"
    },
    {
      "id": "21dbb001-5740-4176-a40f-48935c24bf4b",
      "note_id": "ffb88411-847a-4907-89a1-5085d2849e85",
      "version": 5,
      "short_summary": "JavaScript es el lenguaje esencial para la interactividad en la web, extendiendo su influencia al backend y más allá. Sus fundamentos se construyen sobre los 'Tipos de Datos', que clasifican la información, desde números y texto hasta valores lógicos. Las 'Variables' actúan como contenedores dinámicos para estos datos, permitiendo su almacenamiento y manipulación a lo largo de la ejecución del programa. Finalmente, las 'Estructuras Condicionales' otorgan a los programas la capacidad de tomar decisiones, ejecutando bloques de código específicos solo si se cumplen ciertas condiciones. Dominar estos tres pilares es crucial para construir aplicaciones web robustas y reactivas.",
      "extended_summary": "# 💻 Fundamentos Esenciales de JavaScript\n\nJavaScript (JS) es un lenguaje de programación multiparadigma, ligero e interpretado que constituye una de las tecnologías centrales de la World Wide Web, junto con HTML y CSS. Es el motor que permite la interactividad en el lado del cliente y, gracias a Node.js, ha trascendido al desarrollo de backend, aplicaciones móviles (React Native) y de escritorio (Electron). Creado en 1995 por Brendan Eich mientras trabajaba en Netscape Communications, inicialmente bajo el nombre de \"Mocha\" y luego \"LiveScript\", fue renombrado a \"JavaScript\" por razones de marketing, coincidiendo con el auge de Java en ese momento. Su estandarización a través de Ecma International como ECMAScript (ES) garantiza su interoperabilidad y evolución, con versiones anuales que introducen nuevas características, siendo ES6 (o ES2015) un hito significativo que modernizó el lenguaje.\n\n## Tipos de Datos: La Materia Prima del Código\n\nEn JavaScript, todos los valores son de un tipo de dato específico. Comprenderlos es fundamental para manipular la información de manera efectiva. Los tipos de datos se dividen principalmente en primitivos y no primitivos (objetos).\n\n• **Tipos de Datos Primitivos**: Son inmutables y representan un único valor.\n  • `String`: Cadenas de texto, encerradas entre comillas simples, dobles o \"backticks\" (plantillas literales).\n    javascript\n    let nombre = 'Juan';\n    let mensaje = `Hola, ${nombre}!`;\n    console.log(mensaje); // Salida: Hola, Juan!\n    \n  • `Number`: Números enteros o de punto flotante. JS utiliza un formato de doble precisión de 64 bits para representarlos.\n    javascript\n    let edad = 30;\n    let precio = 29.99;\n    console.log(edad + precio); // Salida: 59.99\n    \n  • `Boolean`: Representa un valor lógico: `true` o `false`.\n    javascript\n    let isActive = true;\n    let isAdmin = false;\n    \n  • `Undefined`: Indica que una variable ha sido declarada pero no se le ha asignado un valor.\n    javascript\n    let sinValor;\n    console.log(sinValor); // Salida: undefined\n    \n  • `Null`: Representa la ausencia intencional de cualquier valor o un objeto nulo. Es un valor que se asigna explícitamente.\n    javascript\n    let objetoNulo = null;\n    console.log(objetoNulo); // Salida: null\n    \n  • `Symbol` (ES6+): Un tipo de dato cuyas instancias son únicas e inmutables, utilizadas para crear identificadores únicos.\n    javascript\n    const id = Symbol('id');\n    const id2 = Symbol('id');\n    console.log(id === id2); // Salida: false\n    \n  • `BigInt` (ES2020+): Permite representar números enteros arbitrariamente grandes, más allá del límite seguro de `Number`.\n    javascript\n    const numeroGrande = 9007199254740991n; // 'n' al final indica BigInt\n    \n\n• **Tipo de Dato No Primitivo**: `Object`. Es una colección de propiedades, donde cada propiedad tiene un nombre (clave) y un valor. Incluye arrays, funciones y objetos literales. Son mutables.\n  • Arrays: Listas ordenadas de valores.\n  • Funciones: Bloques de código reutilizables.\n  • Objetos Literales: Colecciones de pares clave-valor.\n\n### Coerción y Tipado Dinámico\n\nJavaScript es un lenguaje de tipado dinámico, lo que significa que el tipo de una variable se determina en tiempo de ejecución y puede cambiar. También es de tipado débil, lo que permite la coerción implícita de tipos (conversión automática), que puede ser una fuente de errores si no se comprende.\n    javascript\n    let x = '5';\n    let y = 2;\n    console.log(x + y); // Salida: '52' (concatenación)\n    console.log(x * y); // Salida: 10 (coerción a Number)\n    \n\n## Variables: Contenedores de Información Dinámica\n\nLas variables son nombres simbólicos para valores. Se utilizan para almacenar datos que pueden ser referenciados y manipulados a lo largo de un programa. JavaScript ofrece tres palabras clave para declarar variables: `var`, `let` y `const`.\n\n• **`var`**: La forma tradicional de declarar variables. Tiene ámbito de función (function scope) y sufre de \"hoisting\", lo que puede llevar a comportamientos inesperados y difícilmente depurables.\n    javascript\n    function ejemploVar() {\n      if (true) {\n        var saludo = 'Hola';\n      }\n      console.log(saludo); // Salida: 'Hola' (accesible fuera del bloque if)\n    }\n    \n\n• **`let` (ES6+)**: Introduce el ámbito de bloque (block scope), lo que significa que la variable solo es accesible dentro del bloque de código (`{}`) donde fue declarada. No sufre de \"hoisting\" de la misma manera que `var` y no permite redeclaraciones en el mismo ámbito, mejorando la previsibilidad del código.\n    javascript\n    function ejemploLet() {\n      if (true) {\n        let nombre = 'Pedro';\n        console.log(nombre); // Salida: 'Pedro'\n      }\n      // console.log(nombre); // Error: nombre no está definido (fuera del bloque if)\n    }\n    \n\n• **`const` (ES6+)**: También tiene ámbito de bloque, pero se utiliza para declarar constantes. Una vez que se le asigna un valor, este no puede ser reasignado. Sin embargo, para objetos y arrays, el *contenido* de la constante sí puede ser modificado, aunque la referencia al objeto/array no puede cambiarse.\n    javascript\n    const PI = 3.14159;\n    // PI = 3.0; // Error: Asignación a una constante\n\n    const usuario = { nombre: 'Ana' };\n    usuario.nombre = 'Anabella'; // Válido: el contenido del objeto cambia\n    // usuario = { nombre: 'Rosa' }; // Error: no se puede reasignar la referencia\n    \n\nLa recomendación actual para las buenas prácticas es usar `const` por defecto y `let` cuando se sabe que el valor de la variable necesitará ser modificado, y evitar `var` para prevenir errores comunes relacionados con el ámbito y el \"hoisting\".\n\n# 🧠 Lógica y Control de Flujo: Estructuras Condicionales\n\nLa capacidad de un programa para tomar decisiones y ejecutar diferentes acciones basándose en condiciones es lo que le otorga su inteligencia y dinamismo. Las estructuras condicionales en JavaScript son fundamentales para controlar el flujo de ejecución, permitiendo que el código reaccione a diferentes entradas de usuario, estados del sistema o valores de datos. Estas decisiones se basan en la evaluación de expresiones booleanas, que resultan en `true` o `false`.\n\n## Tomando Decisiones: La Clave de la Interactividad\n\nAntes de entrar en las sentencias, es vital conocer los operadores que nos permiten construir las condiciones:\n\n• **Operadores de Comparación**: Comparan dos valores y devuelven un booleano.\n  • `==` (Igualdad flexible): Compara solo el valor, realizando coerción de tipo si es necesario.\n  • `===` (Igualdad estricta): Compara valor Y tipo.\n  • `!=` (Desigualdad flexible): Valor diferente.\n  • `!==` (Desigualdad estricta): Valor O tipo diferente.\n  • `>`, `<`, `>=`, `<=` (Mayor que, menor que, etc.).\n\n• **Operadores Lógicos**: Combinan expresiones booleanas.\n  • `&&` (AND lógico): Verdadero si ambos operandos son verdaderos.\n  • `||` (OR lógico): Verdadero si al menos un operando es verdadero.\n  • `!` (NOT lógico): Invierte el valor booleano del operando.\n\n## Sentencias Condicionales Básicas: if, else if, else\n\nLa estructura `if...else` es la forma más común de implementar la lógica condicional.\n\n• **`if`**: Ejecuta un bloque de código si una condición es verdadera.\n    javascript\n    let temperatura = 25;\n    if (temperatura > 20) {\n      console.log('Hace calor.');\n    }\n    \n\n• **`else`**: Ejecuta un bloque de código si la condición del `if` es falsa.\n    javascript\n    let hora = 10;\n    if (hora < 12) {\n      console.log('Buenos días.');\n    } else {\n      console.log('Buenas tardes.');\n    }\n    \n\n• **`else if`**: Permite especificar múltiples condiciones. Se evalúan secuencialmente, y el primer bloque cuya condición es verdadera se ejecuta. Los siguientes `else if` y el `else` final (si existe) se ignoran.\n    javascript\n    let puntuacion = 85;\n    if (puntuacion >= 90) {\n      console.log('Excelente');\n    } else if (puntuacion >= 70) {\n      console.log('Notable');\n    } else {\n      console.log('Aprobado');\n    }\n    \n\n## Operador Ternario y switch\n\nAdemás de `if/else`, existen otras formas de manejar decisiones.\n\n• **Operador Ternario (`condicion ? exprSiVerdadero : exprSiFalso`)**: Una forma concisa de un `if/else` simple, ideal para asignaciones condicionales o expresiones cortas.\n    javascript\n    let edadUsuario = 19;\n    let mensajeAcceso = (edadUsuario >= 18) ? 'Acceso permitido' : 'Acceso denegado';\n    console.log(mensajeAcceso); // Salida: 'Acceso permitido'\n    \n\n• **`switch`**: Utilizado para manejar múltiples casos específicos basados en el valor de una expresión. Es más legible que una larga cadena de `else if` cuando se comparan muchos valores discretos con una única variable.\n    javascript\n    let diaSemana = 'Lunes';\n    switch (diaSemana) {\n      case 'Lunes':\n        console.log('Inicio de semana.');\n        break;\n      case 'Viernes':\n        console.log('Fin de semana cerca!');\n        break;\n      default:\n        console.log('Es un día normal.');\n        break;\n    }\n    \nEs crucial incluir la sentencia `break;` al final de cada `case` para evitar la \"caída\" (fall-through) a los siguientes `case`.",
      "associations": "[{\"concept\":\"Hoisting\",\"association\":\"En un tranquilo pueblo de código, existía una variable 'var' llamada 'Variana'. Antes de que nadie la declarara formalmente, Variana ya sentía que su nombre era conocido por todos, una especie de fama invisible. Era como si su amor por su valor predestinado la elevara, aunque temporalmente, al principio de cada función, esperando ser llenada.\",\"mnemonic\":\"'Hoisting' es como un fantasma de código que 'eleva' la declaración de 'var' al inicio. Recuerda a 'Host' (anfitrión) que recibe a todos al principio de la fiesta, incluso antes de que lleguen.\"},{\"concept\":\"Scope de Bloque (let/const)\",\"association\":\"Mientras Variana (var) era una enamorada de la libertad, Leticia (let) y Constanza (const) preferían relaciones más exclusivas. Su amor solo florecía dentro de los muros de su 'bloque' ({}). Eran discretas, y si su amado valor intentaba escapar de ese bloque para ser visto fuera, simplemente desaparecía, como un amor secreto que no trasciende las fronteras de su pequeño mundo.\",\"mnemonic\":\"`let` y `const` tienen un amor 'limitado' al `bloque` donde nacen, como si estuvieran en una burbuja.\"},{\"concept\":\"Tipado Dinamico\",\"association\":\"Había una bailarina, Dinamita, que amaba transformarse. Un día era una delicada bailarina de ballet (número), al día siguiente una chispeante estrella de flamenco (cadena de texto), y luego una audaz acróbata (booleano). Su amor por la versatilidad era tan grande que su 'tipo' de expresión cambiaba libremente, adaptándose a cada nueva pasión que la vida le presentaba.\",\"mnemonic\":\"Dinámico = 'Cambia de tipo como cambia de ropa'. JS no te exige un tipo fijo, es flexible.\"},{\"concept\":\"Strict Equality (===)\",\"association\":\"El noble Príncipe Triplemente Igual era un amante exigente. No le bastaba con que su amada se pareciera a él superficialmente (valor); ¡también debía ser de su misma estirpe real (tipo)! Si intentaban presentarle a alguien con el mismo valor pero de un linaje diferente, él se negaba, buscando solo un amor que fuera idéntico en alma y cuerpo, en tipo y valor.\",\"mnemonic\":\"Tres iguales `===` significa 'realmente igual', como buscar un doble *exacto* de ti mismo, no solo alguien parecido.\"},{\"concept\":\"Null vs Undefined\",\"association\":\"En la corte de los datos, existían dos hermanos melancólicos: Nulo y NoDefinido. Nulo, un poeta, había terminado su relación con su amor 'valor', y ahora su corazón estaba conscientemente 'vacío', lo había dejado él mismo. NoDefinido, un soñador, nunca había encontrado su amor; nadie le había asignado uno, por lo que su corazón estaba 'sin asignar', nunca había tenido la oportunidad de sentir ese vacío, simplemente no sabía lo que era tener un valor. Uno fue vaciado, el otro nunca fue llenado.\",\"mnemonic\":\"`null` = 'Nulo, lo puse yo, está vacío *a propósito*'. `undefined` = 'No definido, el sistema no sabe qué poner ahí porque no le dijiste nada'.\"},{\"concept\":\"Operador Ternario\",\"association\":\"El Operador Ternario era un casamentero muy práctico, pero con poco tiempo. Si la pareja 'condición' era compatible, los casaba directamente con el 'primer amor' (valor verdadero); si no, con el 'segundo amor' (valor falso). Todo en una sola frase romántica, sin largas ceremonias, solo una pregunta y dos posibles destinos, como un oráculo del amor rápido y eficiente.\",\"mnemonic\":\"'Ternario' = tiene 3 partes: `condición ? valor_si_verdad : valor_si_falso`. Piensa en un 'triángulo amoroso' de decisiones rápidas.\"},{\"concept\":\"Asignacion const\",\"association\":\"Constantina era una dama de principios firmes. Una vez que entregaba su amor a un valor, ese compromiso era inquebrantable; no había marcha atrás, no se podía reasignar a otro amor diferente. Sin embargo, si su amor se manifestaba en una gran 'colección' de sentimientos (un objeto), ella era flexible y permitía que los detalles de esos sentimientos (propiedades) cambiaran y evolucionaran, siempre y cuando la esencia de la relación principal permaneciera intacta.\",\"mnemonic\":\"`const` es constante en su *referencia*, no en su *contenido*. El cuadro siempre es el mismo, pero lo que hay dentro del cuadro puede cambiar.\"}]",
      "mermaid_map": "mindmap\n  root((Javascript Fundamentos))\n    Tipos de Datos\n      Primitivos\n      Objetos\n      Dinamico Coercion\n    Variables\n      Declaracion var\n      Declaracion let\n      Declaracion const\n      Ambito Hoisting\n    Condicionales\n      If Else\n      Switch\n      Operador Ternario\n      Logica Comparacion\n    Historia y Uso\n      Creacion Brendan Eich\n      Netscape ES\n      Frontend Backend",
      "story": "Clara, una joven desarrolladora con una chispa inagotable por crear, se sentó frente a su monitor, lista para dar vida a su primera aplicación web. Su mentor, Elías, un sabio programador de canas plateadas, sonrió. \"Hoy aprenderás a darle memoria y lógica a tu código\", le dijo.\n\nEmpezaron con las **Variables**. \"Imagina que son cajas\", explicó Elías, \"donde guardas información. Puedes tener una caja para tu nombre (`let nombre = 'Clara';`), otra para tu edad (`let edad = 24;`). Incluso hay cajas que, una vez que pones algo, ya no puedes cambiar el tipo de referencia, como el lema de tu aplicación (`const LEMA = 'Aprender es Crecer';`). Cada dato que pones en estas cajas tiene un **Tipo de Dato**: tu nombre es una cadena de texto, tu edad es un número. JavaScript es fascinantemente flexible; puedes cambiar lo que hay en una caja, incluso el tipo de dato, como si tu caja de 'cantidad' de repente guardara una palabra en lugar de un número. Es lo que llamamos 'tipado dinámico', una espada de doble filo que exige atención, especialmente cuando comparas valores.\n\n\"Pero las aplicaciones no solo guardan datos; también toman decisiones\", continuó Elías. \"Aquí es donde entran las **Estructuras Condicionales**\". Clara visualizó un semáforo. \"Si el semáforo está en verde, avanza (`if (semaforo === 'verde') { avanzar(); }`). Si no, espera (`else { esperar(); }`).\" Elías le mostró cómo podía encadenar decisiones con `else if` o manejar múltiples opciones con un `switch` para un menú. \"Incluso hay atajos para decisiones rápidas, como el operador ternario, útil para cuando quieres que tu código elija entre dos caminos instantáneamente: ¿es de día? Si sí, ¡a trabajar!; si no, ¡a dormir!\".\n\nClara asintió, viendo cómo estas herramientas básicas construían un camino complejo y lleno de posibilidades. Con cada línea de código, su aplicación no solo almacenaba información, sino que cobraba vida, reaccionando inteligentemente a cada situación. Era como si las variables le dieran voz a su programa, y las condicionales le dieran un cerebro, permitiéndole interactuar con el mundo de una manera dinámica y coherente.",
      "image_url": "https://picsum.photos/seed/1047/1200/400",
      "created_at": "2026-02-23T17:53:21.224Z"
    },
    {
      "id": "ad3e3970-d522-4fa7-a289-0f76703ec5ba",
      "note_id": "ffb88411-847a-4907-89a1-5085d2849e85",
      "version": 6,
      "short_summary": "JavaScript, creado en 1995 por Brendan Eich, es el lenguaje de programación esencial para la interactividad y dinamismo de la web. Sirve como la columna vertebral de millones de sitios y aplicaciones, desde animaciones simples hasta complejas Single Page Applications. Sus fundamentos giran en torno a cómo maneja y manipula la información: a través de diversos tipos de datos que representan valores, variables para almacenar y nombrar esos valores, y estructuras condicionales que permiten al programa tomar decisiones y ejecutar código de forma selectiva. Dominar estos pilares es crucial para construir cualquier aplicación funcional y reactiva en el ecosistema digital moderno, extendiéndose más allá del navegador gracias a plataformas como Node.js.",
      "extended_summary": "# 🌐 Fundamentos de JavaScript: El Lenguaje de la Web Interactiva\n\nJavaScript (JS) es, sin duda, uno de los lenguajes de programación más influyentes y ubicuos de la era digital. Concebido en 1995 por Brendan Eich en Netscape Communications, originalmente bajo el nombre de LiveScript y luego Mocha, su propósito inicial fue añadir interactividad a las páginas web que, hasta entonces, eran mayormente estáticas. Su adopción masiva y su evolución, estandarizada a través de ECMAScript, lo han convertido en la base del desarrollo web moderno, impulsando no solo los navegadores sino también servidores (Node.js), aplicaciones móviles (React Native), e incluso dispositivos IoT. Se estima que para 2026, JavaScript seguirá siendo el lenguaje más popular entre los desarrolladores, gracias a su versatilidad y la robustez de su ecosistema.\n\n## 1. Historia y Evolución\n\nLa creación de JavaScript en tan solo diez días es una anécdota legendaria en la historia de la computación. Nació como un lenguaje de scripting ligero, dinámico y tipado débil, diseñado para ejecutarse directamente en el navegador. Su rápido éxito llevó a que Microsoft implementara su propia versión, JScript, lo que generó problemas de compatibilidad. Para resolver esto, Netscape envió el lenguaje a ECMA International para su estandarización, naciendo así ECMAScript en 1997. Las versiones posteriores, especialmente ECMAScript 2015 (ES6), marcaron un antes y un después, introduciendo características fundamentales como `let`, `const`, clases, módulos y arrow functions, que modernizaron profundamente el desarrollo en JS y fomentaron la aparición de frameworks robustos como React, Angular y Vue.js, que hoy dominan la creación de Single Page Applications (SPAs).\n\n# 🧩 Tipos de Datos: La Materia Prima de la Programación\n\nEn JavaScript, los tipos de datos son la clasificación que el lenguaje asigna a diferentes valores. Comprenderlos es fundamental, ya que determina cómo se comportan los valores y qué operaciones se pueden realizar con ellos. JavaScript es un lenguaje de tipado dinámico, lo que significa que no es necesario declarar el tipo de una variable al momento de su creación, sino que el tipo se determina en tiempo de ejecución.\n\n## 2.1 Tipos Primitivos\n\nLos tipos de datos primitivos son valores inmutables que se pasan por valor. JavaScript cuenta con siete tipos primitivos:\n\n*   **`string`**: Representa secuencias de caracteres, utilizados para texto. Pueden ser delimitados por comillas simples (`''`), dobles (`\"\"`) o \"template literals\" (`` ``) que permiten incrustar expresiones y saltos de línea.\n    ```javascript\n    let nombre = \"Alice\";\n    let saludo = `Hola, ${nombre}!`; // Template literal\n    ```\n\n*   **`number`**: Representa tanto números enteros como de punto flotante. Utiliza el formato de doble precisión IEEE 754. Incluye valores especiales como `NaN` (Not-a-Number) e `Infinity`.\n    ```javascript\n    let edad = 30;\n    let precio = 19.99;\n    let resultado = 0 / 0; // NaN\n    ```\n\n*   **`boolean`**: Representa un valor lógico: `true` o `false`. Es fundamental para el control de flujo.\n    ```javascript\n    let estaActivo = true;\n    let esMayor = (edad > 18); // true\n    ```\n\n*   **`undefined`**: Indica que una variable ha sido declarada pero aún no se le ha asignado un valor.\n    ```javascript\n    let miVariable;\n    console.log(miVariable); // undefined\n    ```\n\n*   **`null`**: Representa la ausencia intencional de cualquier valor o un objeto nulo. Es un valor que se asigna explícitamente.\n    ```javascript\n    let objetoVacio = null;\n    ```\n\n*   **`symbol` (ES6)**: Un valor primitivo único e inmutable, a menudo utilizado como clave para propiedades de objetos para evitar colisiones de nombres.\n    ```javascript\n    const id = Symbol('identificador');\n    ```\n\n*   **`bigint` (ES2020)**: Permite representar números enteros con una precisión arbitrariamente grande, más allá del límite seguro de `number`.\n    ```javascript\n    const numeroGrande = 9007199254740991n; // La 'n' al final indica BigInt\n    ```\n\n## 2.2 Tipo Objeto\n\nEl tipo `object` es un tipo de datos no primitivo y mutable. Se pasa por referencia. Todo lo que no es un primitivo en JavaScript es un objeto (o se comporta como tal). Incluye:\n\n*   **Objetos literales**: Colecciones de pares clave-valor.\n    ```javascript\n    let persona = {\n        nombre: \"Juan\",\n        edad: 25\n    };\n    ```\n\n*   **Arrays**: Listas ordenadas de valores, que son un tipo especial de objeto.\n    ```javascript\n    let frutas = [\"manzana\", \"banana\", \"cereza\"];\n    ```\n\n*   **Funciones**: Son objetos de primera clase, lo que significa que pueden ser asignadas a variables, pasadas como argumentos y devueltas desde otras funciones.\n    ```javascript\n    function saludar() {\n        console.log(\"Hola\");\n    }\n    ```\n\n*   **Fechas, RegEx, etc.**\n\n# 🚀 Variables: Almacenando y Nombrando Información\n\nLas variables son contenedores con nombre que utilizamos para almacenar valores de datos. En JavaScript, se pueden declarar variables utilizando las palabras clave `var`, `let` y `const`. La elección de la palabra clave impacta el ámbito (scope) y la mutabilidad de la variable.\n\n## 3.1 Declaración y Asignación\n\n*   **`var` (Legado)**: La forma tradicional de declarar variables. Tienen un ámbito de función (o global si se declara fuera de cualquier función) y son susceptibles de \"hoisting\" (elevación), lo que a menudo lleva a comportamientos inesperados y errores.\n    ```javascript\n    var contador = 10;\n    contador = 12; // Reasignable\n    ```\n\n*   **`let` (ES6)**: Introducido en ES6 (2015), `let` permite declarar variables con ámbito de bloque (block-scoped). Esto significa que la variable solo es accesible dentro del bloque de código donde fue declarada (como un `if`, `for`, `while` o cualquier par de llaves `{}`). Son reasignables.\n    ```javascript\n    let mensaje = \"Hola mundo\";\n    mensaje = \"Adiós mundo\"; // Reasignable\n    if (true) {\n        let x = 5; // x solo existe aquí\n    }\n    // console.log(x); // Error: x no está definido\n    ```\n\n*   **`const` (ES6)**: También introducido en ES6, `const` se utiliza para declarar constantes. Al igual que `let`, tiene ámbito de bloque, pero su valor no puede ser reasignado después de la inicialización. Sin embargo, para objetos y arrays, `const` solo garantiza que la *referencia* no cambiará, no el contenido del objeto o array en sí.\n    ```javascript\n    const PI = 3.14159;\n    // PI = 3; // Error: No se puede reasignar una constante\n\n    const usuario = { nombre: \"Ana\" };\n    usuario.nombre = \"Anabella\"; // Esto es válido (el objeto cambia, no la referencia)\n    // usuario = { nombre: \"Bea\" }; // Error: La referencia es constante\n    ```\n\n## 3.2 Ámbito (Scope) y Elevación (Hoisting)\n\nEl **ámbito** define dónde una variable puede ser accedida en el código. JavaScript tiene tres tipos de ámbito:\n\n*   **Ámbito Global**: Las variables declaradas fuera de cualquier función o bloque. Accesibles desde cualquier parte del código.\n*   **Ámbito de Función**: Las variables `var` declaradas dentro de una función son accesibles solo dentro de esa función.\n*   **Ámbito de Bloque**: Las variables `let` y `const` declaradas dentro de un bloque (`{}`) son accesibles solo dentro de ese bloque.\n\n**Hoisting (Elevación)** es un comportamiento de JavaScript donde las declaraciones de variables y funciones son movidas \"virtualmente\" al inicio de su ámbito antes de la ejecución del código. Con `var`, esto significa que puedes referirte a una variable antes de su declaración, pero su valor será `undefined`. `let` y `const` también se elevan, pero entran en una \"Zona Muerta Temporal\" (Temporal Dead Zone - TDZ) desde el inicio del bloque hasta su declaración, lo que resulta en un error si se intenta acceder a ellas antes de ser declaradas.\n\n# 🚦 Estructuras Condicionales: Tomando Decisiones en el Código\n\nLas estructuras condicionales son fundamentales para el control de flujo de un programa. Permiten ejecutar diferentes bloques de código basándose en si una condición es verdadera o falsa. Son el \"cerebro\" de cualquier aplicación interactiva.\n\n## 4.1 `if` / `else if` / `else`\n\nEsta es la estructura condicional más básica y común. Permite ejecutar un bloque de código si una condición es verdadera, y opcionalmente otro bloque si es falsa, o múltiples bloques para diferentes condiciones.\n\n```javascript\nlet temperatura = 25;\n\nif (temperatura > 30) {\n    console.log(\"Hace mucho calor. ¡Hidrátate!\");\n} else if (temperatura > 20) {\n    console.log(\"Hace una temperatura agradable.\");\n} else {\n    console.log(\"Hace fresco. Abrígate.\");\n}\n```\n\n## 4.2 `switch`\n\nLa sentencia `switch` se utiliza para ejecutar diferentes acciones basadas en diferentes condiciones de un único valor. Es una alternativa más limpia a múltiples `if...else if` encadenados cuando se compara una variable con varios valores específicos.\n\n```javascript\nlet dia = \"Lunes\";\n\nswitch (dia) {\n    case \"Lunes\":\n        console.log(\"Inicio de semana.\");\n        break;\n    case \"Viernes\":\n        console.log(\"¡Por fin es viernes!\");\n        break;\n    default:\n        console.log(\"Día de la semana regular.\");\n}\n```\n\nEs crucial usar la palabra clave `break` para salir del `switch` una vez que se encuentra una coincidencia; de lo contrario, el código continuará ejecutándose en los siguientes `case` (fall-through).\n\n## 4.3 Operador Ternario\n\nEl operador ternario (`condición ? expresionSiVerdadero : expresionSiFalso`) es una forma concisa de escribir una sentencia `if...else` simple, ideal para asignaciones condicionales o expresiones cortas. Es el único operador de JavaScript que toma tres operandos.\n\n```javascript\nlet edadUsuario = 20;\nlet mensajeAcceso = (edadUsuario >= 18) ? \"Acceso permitido\" : \"Acceso denegado\";\nconsole.log(mensajeAcceso); // Salida: Acceso permitido\n\nlet esMiembro = true;\nlet precioProducto = esMiembro ? 10.00 : 15.00;\nconsole.log(precioProducto); // Salida: 10.00\n```",
      "associations": "[{\"concept\":\"null vs undefined\",\"association\":\"Imagina a dos amantes, 'Nulla' y 'Undefined'. Nulla es como un regalo cuidadosamente envuelto que contiene nada, porque su amado quiso darle un 'no-regalo' con intención. Undefined, en cambio, es la ausencia de regalo porque su amado se olvidó por completo de comprarlo o no supo qué regalar, dejando el espacio vacío y sin pensar.\",\"mnemonic\":\"Nulla fue un vacío INTENCIONADO, Undefined es un vacío por DESPITE o desconocimiento.\"},{\"concept\":\"let vs const\",\"association\":\"Leo y Clara están construyendo su casa soñada. Clara (const) es la arquitecta: una vez que dibuja los planos de la fundación, ¡no se mueven! Las paredes estructurales son fijas, aunque pueda cambiar el color de la pintura interior. Leo (let) es el decorador: puede mover los muebles y cuadros de un lado a otro, incluso cambiarlos por completo, siempre dentro de las habitaciones que Clara le ha dado.\",\"mnemonic\":\"Const es como los cimientos de tu casa, Let es como los muebles. Lo básico no se cambia, lo demás sí.\"},{\"concept\":\"string (cadena de texto)\",\"association\":\"Sofi, una romántica empedernida, escribe cartas de amor. Cada palabra, cada frase, cada poema que teje es un 'string', una secuencia de caracteres que solo busca transmitir un mensaje. Y siempre las envuelve con comillas dobles, como si fueran un abrazo digital que protege sus preciosas palabras.\",\"mnemonic\":\"String son cartas de amor, siempre entre comillas, como un abrazo.\"},{\"concept\":\"boolean (verdadero/falso)\",\"association\":\"En el corazón de un romance, siempre hay preguntas binarias: '¿Me amas?' (True/False). '¿Quieres casarte conmigo?' (True/False). Estos son los 'booleanos' de la vida, decisiones cruciales que guían el rumbo de la relación hacia un 'sí' o un 'no' definitivo.\",\"mnemonic\":\"Booleanos son los 'sí o no' del amor.\"},{\"concept\":\"if / else (condicionales)\",\"association\":\"Cuando Miguel planea una cita con Elena, siempre tiene un 'if/else' en mente. 'Si (if) hay sol, iremos al parque. Sino (else), si (else if) llueve, iremos al cine. Si no se da ninguno de los dos casos (else), pues nos quedamos en casa cocinando juntos.'\",\"mnemonic\":\"If/Else: si A, haz esto; si B, haz esto otro; si no, haz aquello.\"},{\"concept\":\"object (objeto)\",\"association\":\"El 'objeto' de su afecto, Luna, es una persona compleja. No es solo un 'nombre' (string) o una 'edad' (number); es un conjunto de cualidades: 'colorDeOjos: verde', 'hobby: pintar', 'cancionFavorita: { titulo: \\\"Starlight\\\", artista: \\\"Muse\\\"}'. Cada cualidad es una 'propiedad' que la define en su totalidad.\",\"mnemonic\":\"Un objeto es como una persona amada, con muchas cualidades (propiedades) que la describen.\"},{\"concept\":\"var (variable legado)\",\"association\":\"Mario, un antiguo enamorado, era muy público con sus sentimientos. Sus declaraciones de amor (var) se escuchaban por todo el pueblo (ámbito global/función) y a veces, incluso antes de que conociera bien a la persona (hoisting con undefined). Era un poco imprudente y causaba malentendidos.\",\"mnemonic\":\"Var: antiguo, ruidoso, y a veces se adelanta (hoisting).\"}]",
      "mermaid_map": "mindmap\n  root((Javascript Fundamentos))\n    Tipos de Datos\n      Primitivos\n        String\n        Number\n        Boolean\n        Undefined Null\n        Symbol Bigint\n      Objetos\n        Literales\n        Arrays\n        Funciones\n    Variables\n      Declaracion\n        Var Legado\n        Let Reasignable\n        Const Constante\n      Ambito\n        Global\n        Funcion\n        Bloque\n      Hoisting\n        Var Comportamiento\n        Let Const TDZ\n    Condicionales\n      If Else If Else\n      Switch Case Break\n      Operador Ternario\n    Historia Javascript\n      Creacion 1995\n      ECMAScript Estandar\n      Usos Navegador Node",
      "story": "En el bullicioso campus de la Universidad TechVerse, Elena, una estudiante apasionada por la botánica digital, soñaba con crear un jardín virtual interactivo. Para ello, sabía que necesitaría el lenguaje mágico: JavaScript. Su proyecto era un regalo para su mentor, el profesor Andrés, un venerable sabio de la programación.\n\nComenzó aprendiendo los 'Tipos de Datos'. Para Elena, eran como las semillas de su jardín. Había semillas para flores coloridas ('string' para los nombres), otras para el número exacto de pétalos ('number'), y algunas que simplemente decían 'Florecerá' o 'No florecerá' ('boolean'). Se aseguró de entender la diferencia entre una semilla que aún no había sido plantada ('undefined') y una maceta que intencionalmente había dejado vacía ('null') para un diseño futuro. Cada tipo tenía un propósito único, y su correcta elección determinaría la belleza y funcionalidad de su jardín digital.\n\nLuego vino el arte de las 'Variables'. Elena usó `let` para nombrar macetas que podían contener diferentes tipos de flores a lo largo de las estaciones, permitiéndole cambiar una rosa por un girasol si así lo deseaba. Para el robusto roble centenario del centro, usó `const`, sabiendo que una vez plantado, su ubicación y especie nunca cambiarían. El viejo `var` lo usó para algunos arbustos auxiliares que el profesor Andrés le había enseñado, pero aprendió rápidamente a preferir `let` y `const` para evitar confusiones en su creciente ecosistema digital. Era crucial que cada maceta tuviera un nombre claro y un propósito definido para no perder el control de su creación.\n\nFinalmente, Elena abordó las 'Estructuras Condicionales', el alma pensante de su jardín. Se preguntó: \"`If` (si) la temperatura es alta, `then` (entonces) regaré las orquídeas tropicales. `Else if` (si no) está nublado, solo regaré ligeramente. `Else` (si no se cumple ninguna), dejaré que el sistema de riego automático se encargue.\" También usó `switch` para decidir qué flores florecerían según el mes, y el `operador ternario` para decisiones rápidas, como si un arbusto necesitaba fertilizante: `(esPocoNutrido ? 'aplicar_fertilizante' : 'no_hacer_nada')`. Con estos principios, su jardín virtual no solo era hermoso, sino que también respondía de manera inteligente a los cambios, floreciendo y adaptándose, un verdadero testimonio de la magia de JavaScript.",
      "image_url": "https://picsum.photos/seed/1047/1200/400",
      "created_at": "2026-02-23T18:13:09.431Z"
    }
  ]
}